tap 'caskroom/cask'
tap 'caskroom/versions'
tap 'caskroom/fonts'
tap 'homebrew/bundle'
tap 'homebrew/dupes'
tap 'homebrew/python'
tap 'homebrew/science'
tap 'homebrew/versions'
tap 'homebrew/binary'
tap 'neovim/neovim'
tap 'd12frosted/emacs-plus'

brew 'archey'
brew 'awscli'
brew 'autojump'
brew 'dos2unix'
brew 'emacs-plus'
brew 'erlang'
# brew 'homebrew/versions/elasticsearch17'
brew 'elasticsearch'
brew 'elixir'
brew 'fish'
brew 'flow'
brew 'go'
brew 'fzf', args: ['HEAD']
brew 'gcc'
brew 'GraphicsMagick'
brew 'hive'
brew 'hub'
brew 'imagemagick'
brew 'n' # node version manager
brew 'keybase'
brew 'mas'
brew 'mitmproxy'
brew 'mongodb'
brew 'mysql'
brew 'phantomjs'
brew 'postgresql'
brew 'pow'
brew 'ruby-build'
brew 'rbenv'
brew 'rbenv-default-gems'
brew 'reattach-to-user-namespace'
brew 'redis'
brew 'switchaudio-osx'
brew 'terraform'
brew 'the_silver_searcher'
brew 'tree'
brew 'watch'
brew 'watchman'
brew 'caskroom/cask/brew-cask'
brew 'homebrew/dupes/apple-gcc42'
brew 'neovim/neovim/neovim', args: ['HEAD']
brew 'heroku-toolbelt'
brew 'python'

cask 'vagrant'
cask '1password'
cask 'acorn'
cask 'alfred'
cask 'arq'
cask 'anvil'
cask 'bartender'
cask 'beamer'
cask 'caffeine'
cask 'caprine' # fb messenger
cask 'colorsnapper'
cask 'cloak'
cask 'cloud'
cask 'dash'
cask 'dropbox'
cask 'duet'
cask 'mojibar'
cask 'flux'
cask 'font-office-code-pro'
cask 'google-chrome'
cask 'hammerspoon'
cask 'handbrake'
cask 'imageoptim'
# cask 'iterm2'
cask 'iterm2-nightly' # for truecolor
cask 'java'
cask 'karabiner-elements'
cask 'mplayerx'
cask 'moom'
cask 'paw'
cask 'prey'
cask 'principle'

# quicklook
cask 'qlcolorcode'
cask 'qlstephen'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'qlprettypatch'
cask 'quicklook-csv'
cask 'betterzipql'
cask 'qlimagesize'
cask 'webpquicklook'
cask 'suspicious-package'

cask 'resolutionator'
cask 'seil'
cask 'sketch'
cask 'send-to-kindle'
cask 'spotify'
cask 'skype'
cask 'steam'
cask 'the-unarchiver'
cask 'zeplin'
