cask_args appdir: "/Applications"

#tap 'homebrew/cask-cask'
tap 'homebrew/cask-versions'
tap 'homebrew/cask-fonts'

tap 'homebrew/bundle'
#tap 'homebrew/dupes'
#tap 'homebrew/python'
#tap 'homebrew/science'
#tap 'homebrew/versions'
#tap 'homebrew/binary'
tap 'homebrew/cask-drivers'
tap 'neovim/neovim'

brew 'archey'
brew 'awscli'
brew 'boost'
brew 'fish'
brew 'go'
brew 'gcc'
brew 'GraphicsMagick'
brew 'hub'
brew 'imagemagick'
brew 'kubernetes-cli'
brew 'n' # node version manager
brew 'mas'
brew 'mitmproxy'
brew 'postgresql'
brew 'ruby-build'
brew 'rbenv'
brew 'rbenv-default-gems'
brew 'redis'
brew 'switchaudio-osx'
brew 'terraform'
brew 'tree'
brew 'watch'
brew 'watchman'
# brew 'caskroom/cask/brew-cask'
brew '/apple-gcc42'
brew 'python'
brew 'yarn'
brew 'koekeishiya/formulae/yabai'


cask '1password'
cask 'alfred'
cask    'android-studio'
cask 'arq'
cask 'bartender'
cask 'caffeine'
cask 'caprine' # fb messenger
cask 'colorsnapper'
cask 'dropbox'
cask 'mojibar'
cask 'flux'
cask 'font-office-code-pro'
cask 'google-chrome'
cask 'google-chrome-canary'
cask 'handbrake'
cask 'imageoptim'
cask 'iterm2'
cask 'java'
cask 'karabiner-elements'
cask 'mplayerx'
cask 'moom'
cask 'paw'
# cask 'prey'
# cask 'principle'
cask 'visual-studio-code'
cask 'nordvpn'

# quicklook
cask 'qlcolorcode'
cask 'qlstephen'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'qlprettypatch'
cask 'quicklook-csv'
cask 'betterzipql'
cask 'qlimagesize'
cask 'webpquicklook'
cask 'suspicious-package'

cask 'resolutionator'
cask 'seil'
cask 'sketch'
cask 'send-to-kindle'
cask 'spotify'
cask 'skype'
cask 'slack'
cask 'zoomus'
cask 'steam'
cask 'the-unarchiver'
cask 'zeplin'
cask 'docker'
cask 'whatsapp'
cask 'chatmate-for-facebook'
cask 'chatmate-for-whatsapp'
cask 'visual-studio-code'
cask 'logitech-options'